<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7540c15566f10a4ca9547ea4f95cddac588a96970283e9311e43ff34cd93fb29","plan_job_ref":"Job Create terraform plan #32 at https://github.com/presentium/infrastructure/actions/runs/10288666547","plan_out_hash":"2ccf065f1ff5e78f421b61ef616d50f26573140509ba85c5637d65bfb28aa655","plan_hash":"17fd69bf12734cc2b3a0e4bfe0fdf286170d38b9b87ffddd4a002b02f15535f6","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once will be created
+   resource "null_resource" "argocd_apply_once" {
+       id       = (known after apply)
+       triggers = {
+           "static" = "deeply-lucky-mako"
        }
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cicd"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::123247571664:role/cicd"
+       tags              = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all          = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["admins_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::123247571664:role/PRES-EKS-ADMIN"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cicd_edit"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSEditPolicy"
+       principal_arn = "arn:aws:iam::123247571664:role/cicd"

+       access_scope {
+           type = "cluster"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #13](https://github.com/presentium/infrastructure/actions/runs/10288689193)